## Plan Result (prod_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 4 to change, 18 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;juror-public&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Delete
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.caching_rule[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.caching_ruleset[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;jd-reply-jury-summons&#34;]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-public&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod" -> null
      - expiration_date          = "0001-01-01T00:00:00.0000000" -> null
      - host_name                = "reply-jury-summons.service.gov.uk" -> null
      - id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/jd-reply-jury-summons" -> null
      - name                     = "jd-reply-jury-summons" -> null
        # (2 unchanged attributes hidden)

      - tls {
          - cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/jdreplyjurysummons-managed-secret" -> null
          - certificate_type        = "CustomerCertificate" -> null
          - minimum_tls_version     = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "2024-02-26T14:40:38.1823034+00:00" -> (known after apply)
      ~ host_name                = "juror-public.apps.hmcts.net" -> "reply-jury-summons.service.gov.uk" # forces replacement
      ~ id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/juror-public" -> (known after apply)
        name                     = "juror-public"
      ~ validation_token         = "mgpbkt3nxfb5p01dj06txhygrpv70dy6" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/0--6f387cd1-1f08-4679-beb0-fb32389f7096-juror-public-apps-hmcts-net" -> (known after apply)
          ~ certificate_type        = "ManagedCertificate" -> "CustomerCertificate"
            # (1 unchanged attribute hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/jd-reply-jury-summons" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/jd-reply-jury-summons",
        ] -> null
      - id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/associations/jd-reply-jury-summons" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/juror-public" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/associations/juror-public" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/jd-reply-jury-summons" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/jd-reply-jury-summonsHttpsRedirect",
        ] -> null
      - id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/associations/jd-reply-jury-summons" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/juror-public" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/associations/juror-public" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdreplyjurysummonsprodPremium" -> null
      - mode                              = "Detection" -> null
      - name                              = "jdreplyjurysummonsprodPremium" -> null
      - request_body_check_enabled        = true -> null
      - resource_group_name               = "lz-prod-rg" -> null
      - sku_name                          = "Premium_AzureFrontDoor" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
          - "startupMode"  = "always"
        } -> null
        # (2 unchanged attributes hidden)

      - managed_rule {
          - action  = "Block" -> null
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      - cdn_frontdoor_origin_group_id  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/jd-reply-jury-summons" -> null
      - certificate_name_check_enabled = true -> null
      - enabled                        = true -> null
      - health_probes_enabled          = true -> null
      - host_name                      = "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com" -> null
      - http_port                      = 80 -> null
      - https_port                     = 443 -> null
      - id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/jd-reply-jury-summons/origins/jd-reply-jury-summons" -> null
      - name                           = "jd-reply-jury-summons" -> null
      - origin_host_header             = "reply-jury-summons.service.gov.uk" -> null
      - priority                       = 1 -> null
      - weight                         = 50 -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/juror-public/origins/juror-public"
        name                           = "juror-public"
      ~ origin_host_header             = "juror-public.apps.hmcts.net" -> "reply-jury-summons.service.gov.uk"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      - cdn_frontdoor_profile_id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod" -> null
      - id                                                        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/jd-reply-jury-summons" -> null
      - name                                                      = "jd-reply-jury-summons" -> null
      - restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10 -> null
      - session_affinity_enabled                                  = false -> null

      - load_balancing {
          - additional_latency_in_milliseconds = 0 -> null
          - sample_size                        = 4 -> null
          - successful_samples_required        = 2 -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/jd-reply-jury-summons",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/jd-reply-jury-summons" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/jd-reply-jury-summons/origins/jd-reply-jury-summons",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/jdreplyjurysummonscaching",
        ] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "HttpOnly" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/jd-reply-jury-summons" -> null
      - link_to_default_domain          = false -> null
      - name                            = "jd-reply-jury-summons" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Https",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/juror-public",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/juror-public"
        name                            = "juror-public"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/jd-reply-jury-summons",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/defaultBackend" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/originGroups/defaultBackend/origins/defaultBackend",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/httpsredirect",
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/jdreplyjurysummonscaching",
        ] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "MatchRequest" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/jd-reply-jury-summonsHttpsRedirect" -> null
      - link_to_default_domain          = false -> null
      - name                            = "jd-reply-jury-summonsHttpsRedirect" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Http",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/juror-public",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/juror-publicHttpsRedirect"
        name                            = "juror-publicHttpsRedirect"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.caching_rule["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_rule" "caching_rule" {
      - behavior_on_match           = "Continue" -> null
      - cdn_frontdoor_rule_set_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/jdreplyjurysummonscaching" -> null
      - cdn_frontdoor_rule_set_name = "jdreplyjurysummonscaching" -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/jdreplyjurysummonscaching/rules/jdreplyjurysummonscachingrule" -> null
      - name                        = "jdreplyjurysummonscachingrule" -> null
      - order                       = 3 -> null

      - actions {
          - route_configuration_override_action {
              - cache_behavior                = "HonorOrigin" -> null
              - compression_enabled           = false -> null
              - query_string_caching_behavior = "UseQueryString" -> null
              - query_string_parameters       = [] -> null
                # (3 unchanged attributes hidden)
            }
        }

      - conditions {
          - url_file_extension_condition {
              - match_values     = [
                  - "jpg",
                  - "png",
                  - "css",
                  - "ico",
                  - "js",
                ] -> null
              - negate_condition = false -> null
              - operator         = "Equal" -> null
              - transforms       = [
                  - "Lowercase",
                ] -> null
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.caching_ruleset["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_rule_set" "caching_ruleset" {
      - cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod" -> null
      - id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/jdreplyjurysummonscaching" -> null
      - name                     = "jdreplyjurysummonscaching" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_secret" "certificate" {
      - cdn_frontdoor_profile_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod" -> null
      - id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/jdreplyjurysummons-managed-secret" -> null
      - name                       = "jdreplyjurysummons-managed-secret" -> null
        # (1 unchanged attribute hidden)

      - secret {
          - customer_certificate {
              - key_vault_certificate_id  = "https://acmedtssdsprod.vault.azure.net/certificates/reply-jury-summons-service-gov-uk" -> null
              - subject_alternative_names = [
                  - "reply-jury-summons.service.gov.uk",
                ] -> null
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + cdn_frontdoor_profile_name = (known after apply)
      + id                         = (known after apply)
      + name                       = "jurorpublic-managed-secret"

      + secret {
          + customer_certificate {
              + key_vault_certificate_id  = "https://acmedtssdsprod.vault.azure.net/certificates/reply-jury-summons-service-gov-uk"
              + subject_alternative_names = (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod" -> null
      - id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/securityPolicies/jdreplyjurysummonsprodPremium-securityPolicy" -> null
      - name                     = "jdreplyjurysummonsprodPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdreplyjurysummonsprodPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/jd-reply-jury-summons" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/securityPolicies/jurorpublicprodPremium-securityPolicy" -> (known after apply)
        name                     = "jurorpublicprodPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/juror-public" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["jd-reply-jury-summons"] will be destroyed
  # (because key ["jd-reply-jury-summons"] is not in for_each map)
  - resource "azurerm_dns_txt_record" "public_dns_record" {
      - fqdn                = "_dnsauth.reply-jury-summons.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/reply-jury-summons.service.gov.uk/TXT/_dnsauth" -> null
      - name                = "_dnsauth" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 3600 -> null
      - zone_name           = "reply-jury-summons.service.gov.uk" -> null

      - record {
          - value = "validated" -> null
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-public"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.juror-public.apps.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.juror-public" -> (known after apply)
      ~ name                = "_dnsauth.juror-public" -> "_dnsauth" # forces replacement
      - tags                = {} -> null
      ~ zone_name           = "apps.hmcts.net" -> "reply-jury-summons.service.gov.uk" # forces replacement
        # (2 unchanged attributes hidden)

      - record {
          - value = "mgpbkt3nxfb5p01dj06txhygrpv70dy6" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 4 to change, 18 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":811,"Program":"tfcmt","SHA1":"","Target":"prod_frontdoor","Vars":{}} -->